In [4]:
import pandas as pd

In [5]:
df= pd.read_csv("weather_data.csv")
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [12]:
# to create a dataframe

df1=[('1/1/2017',34,7,'Sunny'), ('4/1/2018',45,7,'Windy'),('8/1/2019',12,8,'Rainy')]
df1

[('1/1/2017', 34, 7, 'Sunny'),
 ('4/1/2018', 45, 7, 'Windy'),
 ('8/1/2019', 12, 8, 'Rainy')]

In [13]:
df1=pd.DataFrame(df,columns=['day','temp','windspeed','event'])
df1

        day  temp  windspeed  event
0  1/1/2017   NaN          6   Rain
1  1/2/2017   NaN          7  Sunny
2  1/3/2017   NaN          2   Snow
3  1/4/2017   NaN          7   Snow
4  1/5/2017   NaN          4   Rain
5  1/6/2017   NaN          2  Sunny

In [14]:
df1

        day  temp  windspeed  event
0  1/1/2017   NaN          6   Rain
1  1/2/2017   NaN          7  Sunny
2  1/3/2017   NaN          2   Snow
3  1/4/2017   NaN          7   Snow
4  1/5/2017   NaN          4   Rain
5  1/6/2017   NaN          2  Sunny

In [15]:
df.head()

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain

In [16]:
df.tail()

        day  temperature  windspeed  event
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [18]:
# slicing 
# df [ start of a row , end row -1]
df[1:4]

        day  temperature  windspeed  event
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow

In [20]:
df.columns   # list of all columns in a table

Index(['day', 'temperature', 'windspeed', 'event'], dtype='object')

In [21]:
# ways for accessing columns

df.day

0    1/1/2017
1    1/2/2017
2    1/3/2017
3    1/4/2017
4    1/5/2017
5    1/6/2017
Name: day, dtype: object

In [22]:
df['day']

0    1/1/2017
1    1/2/2017
2    1/3/2017
3    1/4/2017
4    1/5/2017
5    1/6/2017
Name: day, dtype: object

In [26]:
# different ways to read the values in the columns 

df.temperature.describe()

count     6.000000
mean     30.333333
std       3.829708
min      24.000000
25%      28.750000
50%      31.500000
75%      32.000000
max      35.000000
Name: temperature, dtype: float64

In [27]:
df['temperature'].describe()

count     6.000000
mean     30.333333
std       3.829708
min      24.000000
25%      28.750000
50%      31.500000
75%      32.000000
max      35.000000
Name: temperature, dtype: float64

In [28]:
# select rows with max temperature

df[df.temperature==df.temperature.max()]

        day  temperature  windspeed  event
1  1/2/2017           35          7  Sunny

In [34]:
df2=pd.read_excel("weather_data.xlsx", sheetname='weather_data')
df2

C:\Users\Kushal Kumar\Anaconda3\lib\site-packages\pandas\util\_decorators.py:118: FutureWarning: The `sheetname` keyword is deprecated, use `sheet_name` instead
  return func(*args, **kwargs)

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [35]:
df=pd.read_csv("weather_data_cities.csv")
df

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [47]:
g=df.groupby('city')
g

In [48]:
for city, city_df in g:
    print(city)
    print(city_df)

mumbai
        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain
new york
        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny
paris
         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

In [51]:
# to get group by for cities

g.get_group('mumbai')

        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain

In [52]:
#maximum value

print(g.max())

               day  temperature  windspeed  event
city
mumbai    1/4/2017           92         15  Sunny
new york  1/4/2017           36         12  Sunny
paris     1/4/2017           54         20  Sunny

In [53]:
print(g.mean())

          temperature  windspeed
city
mumbai          88.50       9.25
new york        32.25       8.00
paris           47.75      12.75

In [54]:
print(g.describe())

         temperature                                                   \
               count   mean       std   min    25%   50%    75%   max
city
mumbai           4.0  88.50  3.109126  85.0  86.50  88.5  90.50  92.0
new york         4.0  32.25  3.304038  28.0  31.00  32.5  33.75  36.0
paris            4.0  47.75  5.315073  42.0  44.25  47.5  51.00  54.0

         windspeed
             count   mean       std  min   25%   50%    75%   max
city
mumbai         4.0   9.25  5.057997  5.0  5.00   8.5  12.75  15.0
new york       4.0   8.00  2.708013  6.0  6.75   7.0   8.25  12.0
paris          4.0  12.75  5.251984  8.0  9.50  11.5  14.75  20.0

# Concatenate Data Frames

In [58]:
india_weather=pd.DataFrame( { "city": ["mumbai", "Bangalore", "Chennai"] , "temperature": [34,23,45],"humidity":[45,56,87]})
india_weather

        city  humidity  temperature
0     mumbai        45           34
1  Bangalore        56           23
2    Chennai        87           45

In [59]:
us_weather=pd.DataFrame({ "city" :["California" ,"Losangels","Newyork"], "temperature":[34,45,64],"humidity":[45,56,23]})
us_weather

         city  humidity  temperature
0  California        45           34
1   Losangels        56           45
2     Newyork        23           64

In [61]:
# concat two frames
df=pd.concat([india_weather, us_weather])
df

         city  humidity  temperature
0      mumbai        45           34
1   Bangalore        56           23
2     Chennai        87           45
0  California        45           34
1   Losangels        56           45
2     Newyork        23           64

In [62]:
# concat two frames in the same rows
df=pd.concat([india_weather, us_weather], axis=1)
df

        city  humidity  temperature        city  humidity  temperature
0     mumbai        45           34  California        45           34
1  Bangalore        56           23   Losangels        56           45
2    Chennai        87           45     Newyork        23           64